---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveFromChainMultipleIntersWithDivLine
source: html/e3b65deb-5e55-422b-21a7-e5d6c3829803.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveFromChainMultipleIntersWithDivLine Property

A curve from the chain formed by these curve elements either intersects a gridline more than once or coincides with it and so the chain will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveFromChainMultipleIntersWithDivLine { get; }
```